ИсходныйОбъектСсылка = ДокументОбъект.ИсходныйДокумент;

ДокументОбъект.Комментарий = "Правила с учетом SSC-396 2021-04-21 "+Строка(ТекущаяДата());

ЗначениеДатыФакта = УправлениеСвойствами.ЗначениеСвойства(ИсходныйОбъектСсылка,ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","ДатаОФД"));
Если значениеЗаполнено(ЗначениеДатыФакта) тогда 
ДокументОбъект.Дата =  ЗначениеДатыФакта;
Иначе 
ДокументОбъект.Дата = ИсходныйОбъектСсылка.ДатаВходящегоДокумента;
КонецЕсли;

ДокументОбъект.ДокументБД = Справочники.ДокументыБД.НайтиПоНаименованию("ПоступлениеТоваровУслуг");
ДокументОбъект.Комментарий = "ДатаОФД"+Строка(ЗначениеДатыФакта)+ "Правила с учетом SSC-396 2021-04-21 "+Строка(ТекущаяДата());
ДокументОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;


БюджетДоходовИРасходов  = ДокументОбъект.БюджетДоходовИРасходов;


лТекст = "
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ПоступлениеТоваровУслугУслуги.СчетЗатрат = &Счет20
		|			ТОГДА ПоступлениеТоваровУслугУслуги.Субконто2
		|		КОГДА ПоступлениеТоваровУслугУслуги.СчетЗатрат В (&СписокСчетовОПХР)
		|			ТОГДА ПоступлениеТоваровУслугУслуги.Субконто1
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
		|	КОНЕЦ КАК СтатьяЗатрат,
		|	ВЫБОР
		|		КОГДА ПоступлениеТоваровУслугУслуги.СчетЗатрат = &Счет20
		|			ТОГДА ПоступлениеТоваровУслугУслуги.Субконто1
		|		ИНАЧЕ ЗНАЧЕНИЕ(справочник.НоменклатурныеГруппы.пустаяссылка)
		|	КОНЕЦ КАК НоменклатурнаяГруппа,
		|	ПоступлениеТоваровУслугУслуги.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	ВЫБОР
		|		КОГДА ПоступлениеТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
		|			ТОГДА ПоступлениеТоваровУслугУслуги.Сумма - ПоступлениеТоваровУслугУслуги.СуммаНДС
		|		ИНАЧЕ ПоступлениеТоваровУслугУслуги.Сумма
		|	КОНЕЦ КАК СуммаБезНДС,
		|	ПоступлениеТоваровУслугУслуги.СуммаНДС КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА ПоступлениеТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
		|			ТОГДА ПоступлениеТоваровУслугУслуги.Сумма
		|		ИНАЧЕ ПоступлениеТоваровУслугУслуги.Сумма + ПоступлениеТоваровУслугУслуги.СуммаНДС
		|	КОНЕЦ КАК СуммаСНДС,
		|	ПоступлениеТоваровУслугУслуги.СчетЗатрат КАК СчетЗатрат,
		|	ПоступлениеТоваровУслугУслуги.Ссылка.ДоговорКонтрагента.ОсновнойПроект КАК ОсновнойПроект,
		|	ПоступлениеТоваровУслугУслуги.Ссылка.ДоговорКонтрагента.ОсновнаяСтатьяИсполнение КАК СтатьяИсполнение
		|ПОМЕСТИТЬ ВТ_Услуги
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
		|ГДЕ
		|	ПоступлениеТоваровУслугУслуги.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Услуги.СтатьяЗатрат КАК СтатьяЗатрат,
		|	ВТ_Услуги.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
		|	ВТ_Услуги.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	ВТ_Услуги.СуммаБезНДС КАК СуммаБезНДС,
		|	ВТ_Услуги.СуммаНДС КАК СуммаНДС,
		|	ВТ_Услуги.СчетЗатрат КАК СчетЗатрат,
		|	ВТ_Услуги.СуммаСНДС КАК СуммаСНДС,
		|	ВЫБОР
		|		КОГДА НоменклатурныеГруппыДополнительныеРеквизиты.Значение <> ЗНАЧЕНИЕ(справочник.проекты.пустаяссылка)
		|			ТОГДА НоменклатурныеГруппыДополнительныеРеквизиты.Значение
		|		ИНАЧЕ ВТ_Услуги.ОсновнойПроект
		|	КОНЕЦ КАК Проект,
		|	ВЫБОР
		|		КОГДА ПОДСТРОКА(ВТ_Услуги.СчетЗатрат.Код, 1, 2) = ""08""
		|			ТОГДА ВЫБОР
		|					КОГДА ВТ_Услуги.СтатьяИсполнение ССЫЛКА Справочник.СтатьиДоходовИРасходов
		|						ТОГДА ВТ_Услуги.СтатьяИсполнение
		|					ИНАЧЕ ЗНАЧЕНИЕ(справочник.СтатьиДоходовИРасходов.ПустаяСсылка)
		|					КОНЕЦ
		|		КОГДА СтатьиЗатратДополнительныеРеквизиты.Значение <> ЗНАЧЕНИЕ(справочник.СтатьиДоходовИРасходов.ПустаяСсылка)
		|			ТОГДА СтатьиЗатратДополнительныеРеквизиты.Значение
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВТ_Услуги.СтатьяИсполнение ССЫЛКА Справочник.СтатьиДоходовИРасходов
		|					ТОГДА ВТ_Услуги.СтатьяИсполнение
		|				ИНАЧЕ ЗНАЧЕНИЕ(справочник.СтатьиДоходовИРасходов.ПустаяСсылка)
		|			КОНЕЦ
		|	КОНЕЦ КАК СтатьяИсполнение
		|ИЗ
		|	ВТ_Услуги КАК ВТ_Услуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтатьиЗатрат.ДополнительныеРеквизиты КАК СтатьиЗатратДополнительныеРеквизиты
		|		ПО ВТ_Услуги.СтатьяЗатрат = СтатьиЗатратДополнительныеРеквизиты.Ссылка
		|		И (СтатьиЗатратДополнительныеРеквизиты.Свойство.Имя = ""СтатьяДоходовИРасходов"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатурныеГруппы.ДополнительныеРеквизиты КАК НоменклатурныеГруппыДополнительныеРеквизиты
		|		ПО ВТ_Услуги.НоменклатурнаяГруппа = НоменклатурныеГруппыДополнительныеРеквизиты.Ссылка
		|		И (НоменклатурныеГруппыДополнительныеРеквизиты.свойство.имя  = ""Проект"")
		|ГДЕ
		|	ВТ_Услуги.СтатьяЗатрат ССЫЛКА Справочник.СтатьиЗатрат
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Услуги.СтатьяЗатрат,
		|	ВТ_Услуги.НоменклатурнаяГруппа,
		|	ВТ_Услуги.СуммаВключаетНДС,
		|	ВТ_Услуги.СуммаБезНДС,
		|	ВТ_Услуги.СуммаНДС,
		|	ВТ_Услуги.СчетЗатрат,
		|	ВТ_Услуги.СуммаСНДС,
		|	ВТ_Услуги.ОсновнойПроект,
		|	ВЫБОР
		|		КОГДА ПрочиеДоходыИРасходыДополнительныеРеквизиты.Значение <> ЗНАЧЕНИЕ(справочник.СтатьиДоходовИРасходов.ПустаяСсылка)
		|			ТОГДА ПрочиеДоходыИРасходыДополнительныеРеквизиты.Значение
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВТ_Услуги.СтатьяИсполнение ССЫЛКА Справочник.СтатьиДоходовИРасходов
		|					ТОГДА ВТ_Услуги.СтатьяИсполнение
		|				ИНАЧЕ ЗНАЧЕНИЕ(справочник.СтатьиДоходовИРасходов.ПустаяСсылка)
		|			КОНЕЦ
		|	КОНЕЦ
		|ИЗ
		|	ВТ_Услуги КАК ВТ_Услуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПрочиеДоходыИРасходы.ДополнительныеРеквизиты КАК ПрочиеДоходыИРасходыДополнительныеРеквизиты
		|		ПО ВТ_Услуги.СтатьяЗатрат = ПрочиеДоходыИРасходыДополнительныеРеквизиты.Ссылка
		|		И (ПрочиеДоходыИРасходыДополнительныеРеквизиты.Свойство.Имя = ""СтатьяДоходовИРасходов"")
		|ГДЕ
		|	ВТ_Услуги.СтатьяЗатрат ССЫЛКА Справочник.ПрочиеДоходыИРасходы
		|";

	лЗапрос = Новый Запрос(лТекст);
	лЗапрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;


	// Присвоение значений переменным параметров.
	СписокСчетовОПХР = Новый Массив;
	СписокСчетовОПХР.Добавить(ПланыСчетов.Хозрасчетный.ОбщехозяйственныеРасходы); // 26 Общехозяйственные расходы
	СписокСчетовОПХР.Добавить(ПланыСчетов.Хозрасчетный.ИздержкиОбращения); // 44.01 Издержки обращения в организациях, осуществляющих торговую деятельность
	СписокСчетовОПХР.Добавить(ПланыСчетов.Хозрасчетный.КоммерческиеРасходы); // 44.02 
	СписокСчетовОПХР.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасходы); // 91.02 Прочие расходы

	Счет20 = ПланыСчетов.Хозрасчетный.ОсновноеПроизводство; // 20.01 Основное производство

	
	// Установка параметров.
	лЗапрос.УстановитьПараметр("СписокСчетовОПХР", СписокСчетовОПХР);
	лЗапрос.УстановитьПараметр("Ссылка", ИсходныйОбъектСсылка);
	лЗапрос.УстановитьПараметр("Счет20", Счет20);


	лВыборка = лЗапрос.Выполнить().Выбрать();

	БюджетДоходовИРасходов.Очистить();
	
	Пока лВыборка.Следующий() Цикл

		лНоваяСтрока = БюджетДоходовИРасходов.Добавить();
		лНоваяСтрока.СтатьяДоходовИРасходов         = лВыборка.СтатьяИсполнение;
		лНоваяСтрока.Проект               = лВыборка.Проект;
		лНоваяСтрока.СуммаБезНДС          = лВыборка.СуммаБезНДС;
		лНоваяСтрока.СуммаНДС             = лВыборка.СуммаНДС;
		лНоваяСтрока.Сумма                = лВыборка.СуммаСНДС;
		
		лНоваяСтрока.ВалютаВзаиморасчетов = ИсходныйОбъектСсылка.ВалютаДокумента;
		//добавить условие по валюте
		лНоваяСтрока.СуммаВзаиморасчетовБезНДС          = лВыборка.СуммаБезНДС;
		лНоваяСтрока.СуммаВзаиморасчетовНДС             = лВыборка.СуммаНДС;
		лНоваяСтрока.СуммаВзаиморасчетов                = лВыборка.СуммаСНДС;

		
		
	КонецЦикла;
