
// БДР
Процедура ТекстЗапросаВременнаяТаблицаБДР(Запрос, ТекстыЗапроса)
	
	ИмяВременнойТаблицы = "ТаблицаБДР";
	
	УстановитьПараметрыЗапросаКоэффициентыВалют(Запрос);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Факт.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.ПустаяСсылка)
	|			ТОГДА &ПриходРасход
	|		ИНАЧЕ Факт.ПриходРасход
	|	КОНЕЦ КАК ПриходРасход,
	|	Факт.ЦФО КАК ЦФО,
	|	Факт.Проект КАК Проект,
	|	Факт.СтатьяДоходовИРасходов КАК СтатьяДоходовИРасходов,
	|	Факт.Аналитика1 КАК Аналитика1,
	|	Факт.Аналитика2 КАК Аналитика2,
	|	Факт.Аналитика3 КАК Аналитика3,
	|	Факт.Аналитика4 КАК Аналитика4,
	|	Факт.Аналитика5 КАК Аналитика5,
	|	Факт.Аналитика6 КАК Аналитика6,
	|	Факт.ДокументПланирования КАК ДокументПланирования,
	|	&ПустойUID КАК ИдентификаторПозиции,
	|	ВЫБОР
	|		КОГДА Факт.ВалютаВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА Факт.Сумма - Факт.СуммаНДС
	|		ИНАЧЕ Факт.СуммаВзаиморасчетов - Факт.СуммаВзаиморасчетовНДС
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА Факт.ВалютаВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА &ВалютаДокумента
	|		ИНАЧЕ Факт.ВалютаВзаиморасчетов
	|	КОНЕЦ КАК Валюта,
	|	ВЫБОР
	|		КОГДА &ВалютаДокумента = &ВалютаУправленческогоУчета
	|			ТОГДА Факт.Сумма - Факт.СуммаНДС
	|		КОГДА &ВалютаУправленческогоУчета = Факт.ВалютаВзаиморасчетов
	|				И Факт.ВалютаВзаиморасчетов <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА Факт.СуммаВзаиморасчетов - Факт.СуммаВзаиморасчетовНДС
	|		ИНАЧЕ 
	|           Выбор Когда Факт.СуммУпр_ОЦО = 0 
	|    			  Тогда ВЫРАЗИТЬ((Факт.Сумма - Факт.СуммаНДС) * &КоэффициентПересчетаВВалютуУпр КАК ЧИСЛО(15, 2))
	|                 Иначе Факт.СуммУпр_ОЦО
	|			Конец	
	|	КОНЕЦ КАК СуммаУпр
	|ПОМЕСТИТЬ ТаблицаБДР
	|ИЗ
	|	Документ.ОтражениеФактическихДанныхБюджетирования.БюджетДоходовИРасходов КАК Факт
	|ГДЕ
	|	Факт.Ссылка = &Ссылка
	|	И &ИспользоватьБДР = ИСТИНА";
	
	Запрос.УстановитьПараметр("ПустойUID", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяВременнойТаблицы);
	
КонецПроцедуры
