Процедура ДобавитьПолеНаФормуПрограммно(ИмяПоляФ,ВидПоляФормыП,Заголовок, размещение)
	

	ПолеВвода = Элементы.Добавить(
		ИмяПоляФ,    //Имя элемента формы
		Тип("ПолеФормы"), //Тип, всегда ПолеФормы
		размещение);	      //Контейнер для поля ввода (Форма,Группа,Страница)
		
	ПолеВвода.Заголовок = Заголовок;
	ПолеВвода.Вид = ВидПоляФормыП;
	ПолеВвода.ПутьКДанным = "Объект."+ИмяПоляФ;

	

КонецПроцедуры

//ниже пример для добавления 3х элементов на форму
//для документа ОФД
&НаСервере
Процедура ПриСозданииНаСервереПосле_ОЦО(Отказ, СтандартнаяОбработка)
	

ДобавитьПолеНаФормуПрограммно("Скорректирован",видполяформы.ПолеФлажка,"Скорректирован",ЭтаФорма.Элементы.ГруппаРеквизиты);
ДобавитьПолеНаФормуПрограммно("ДатаКорректировки",видполяформы.ПолеФлажка,"Дата корректировки",ЭтаФорма.Элементы.ГруппаРеквизиты);
ДобавитьПолеНаФормуПрограммно("ТребуетсяКорректировка",видполяформы.ПолеФлажка,"Требуется корректировка",ЭтаФорма.Элементы.ГруппаРеквизиты);

		
КонецПроцедуры
